bit-finance/Catalogs/бит_СтатьиБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиБюджета</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование элемента справочника для вывода на печать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код. Используется для вывода в отчетах и печатных формах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображать</Name>
					<Comment>Не отображать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьТекстКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Enums/бит_РасходДоход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РасходДоход</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расходование</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_Бюджеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_Бюджеты</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование элемента справочника для вывода на печать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Код, предназначенный для вывода в отчеты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Catalogs/бит_СтатьиБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов.
// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  МассивРеквизитов - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить("Владелец");
	
	Возврат МассивРеквизитов;
	
КонецФункции // Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов.

// Процедура копирует статьи из бюджета источника в бюджет приемник.
//
// Параметры:
//  Источник - СправочникСсылка.бит_Бюджеты	 - Ссылка на бюджет источник копирования.
//  Приемник - СправочникСсылка.бит_Бюджеты	 - Ссылка на бюджет приемник.
//
Процедура СкопироватьСтатьи(Источник, Приемник) Экспорт 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Источник);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиБюджета.Родитель КАК Родитель,
	|	СтатьиБюджета.ЭтоГруппа КАК ЭтоГруппа,
	|	СтатьиБюджета.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СтатьиБюджета.ЭтоРасчет, ЛОЖЬ) КАК ЭтоРасчет
	|ИЗ
	|	Справочник.бит_СтатьиБюджета КАК СтатьиБюджета
	|ГДЕ
	|	СтатьиБюджета.Владелец = &Владелец
	|	И НЕ СтатьиБюджета.ПометкаУдаления";
	Результа = Запрос.Выполнить();
	
	СоответствиеСтатей = Новый Соответствие;
	Выборка            = Результа.Выбрать();
	
	НачатьТранзакцию();
	Пока Выборка.Следующий() Цикл
		НоваяСтатья = Выборка.Ссылка.Скопировать();
		НоваяСтатья.Владелец = Приемник;
		НоваяСтатья.Родитель = СоответствующаяСтатья(Выборка.Родитель, СоответствиеСтатей);
		НоваяСсылка          = СоответствующаяСтатья(Выборка.Ссылка, СоответствиеСтатей);
		НоваяСтатья.УстановитьСсылкуНового(НоваяСсылка);
		
		Если Выборка.ЭтоРасчет Тогда
			Для каждого ПараметрРасчета Из НоваяСтатья.ПараметрыРасчета Цикл
				ПараметрРасчета.ЗначениеПараметра = СоответствующаяСтатья(ПараметрРасчета.ЗначениеПараметра, СоответствиеСтатей);
			КонецЦикла;
		КонецЕсли;
		
		НоваяСтатья.УстановитьНовыйКод();
		НоваяСтатья.ДополнительныеСвойства.Вставить("ЭтоКопирование", Истина);
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НоваяСтатья, Истина);
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось скопировать статьи бюджета.
                                   |%1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
	КонецЦикла;
	Справочники.бит_Бюджеты.ОбработатьБюджетЗапрещенКПланированию(Приемник);
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьРеквизитДопУпорядочиванияПриПереходеНаНовуюВерсию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Список.РеквизитДопУпорядочивания) КАК РеквизитДопУпорядочивания,
	|	Список.Владелец КАК Владелец
	|ИЗ
	|	Справочник.бит_СтатьиБюджета КАК Список
	|
	|СГРУППИРОВАТЬ ПО
	|	Список.Владелец
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Список.РеквизитДопУпорядочивания) = 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса	 = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		Выборка = Справочники.бит_СтатьиБюджета.ВыбратьИерархически(, ВыборкаЗапроса.Владелец,,"Кодификатор");
		Пока Выборка.Следующий() Цикл
			ТекущийОбъект = Выборка.ПолучитьОбъект();
			НастройкаПорядкаЭлементов.УстановитьЗначениеРеквизитаУпорядочивания(ТекущийОбъект);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Функция НовыеПараметрыЗаполненияПоГруппеСтатейБюджета() Экспорт

	Параметры = Новый Структура; 
	Параметры.Вставить("Бюджет");
	Параметры.Вставить("ГруппаСтруктуры", Справочники.бит_СтатьиБюджета.ПустаяСсылка());
	Параметры.Вставить("ГруппаСтатей", Новый Массив()); // Массив подобранных групп или элементов.
	Параметры.Вставить("Коэффициент", 0);

	Возврат Параметры;
	
КонецФункции

// Длительная операция заполнения справочника по группе статей бюджета.
//
// Параметры:
//  ДанныеЗаполнения - Структура - состав стуктуры формируется функцией "НовыеПараметрыЗаполненияПоГруппеСтатейБюджета". 
//  АдресВХранилище	 - Строка - адрес во временном хранилище.
//
Процедура ЗаполнитьПоГруппеСтатейБюджета(ДанныеЗаполнения, АдресВХранилище) Экспорт

	Бюджет 			= ДанныеЗаполнения.Бюджет;
	ГруппаСтруктуры = ДанныеЗаполнения.ГруппаСтруктуры;
	ГруппаСтатей 	= ДанныеЗаполнения.ГруппаСтатей;
	Коэффициент     = ДанныеЗаполнения.Коэффициент;
		
	Выборка 		   = ВыборкаСтатейБюджета(Бюджет, ГруппаСтатей);
	Родители 		   = Новый Соответствие;  
	ДобавленныеОбъекты = Новый Массив(); 
	Ошибки 			   = Новый Соответствие(); 

	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			ТекущийОбъект = Справочники.бит_СтатьиБюджета.СоздатьГруппу();
			ЗаполнитьЗначенияСвойств(ТекущийОбъект, Выборка,,"Родитель, Ссылка, ЭтоГруппа, НаименованиеПолное");
		Иначе
			ТекущийОбъект = Справочники.бит_СтатьиБюджета.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ТекущийОбъект, Выборка,,"Родитель, Ссылка, ЭтоГруппа");
		КонецЕсли; 
		
		ТекущийОбъект.Владелец = Бюджет;

		Если Выборка.ЭтоГруппа Тогда
			ТекущийОбъект.Коэффициент = ?(Коэффициент = 0, 1, Коэффициент);		
		Иначе	
			Если Коэффициент <> 0 Тогда
				ТекущийОбъект.Коэффициент = Коэффициент;
			Иначе	
				ТекущийОбъект.Коэффициент = ?(Выборка.РасходДоход = Перечисления.бит_РасходДоход.Расходование, -1, 1);
			КонецЕсли; 		
		КонецЕсли;  
				
		// ГруппаСтатей - это массив, содержаший в себе выбранные пользователем элементы (группы).
		// Однако, Выборка запроса не содержит ссылку на корневй элемент, если пользователь
		// решил вызять весь справочник. Приходится проверять вхождение.
		Если ГруппаСтатей.Найти(Выборка.Ссылка) = Неопределено Тогда
			СтатьяОборотов = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
		Иначе	
			СтатьяОборотов = Выборка.Ссылка;
		КонецЕсли; 
		
		НовыйРодитель = Родители.Получить(Выборка.Родитель);
		Если НовыйРодитель = Неопределено Тогда
			Если Выборка.Ссылка = СтатьяОборотов Тогда
				// Считаем, что выше групп нет - это целевая группа структуры бюджета.
				НовыйРодитель = ГруппаСтруктуры;
			ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.Родитель) И НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
				// Выбран корневой элемент справочника "бит_СтатьиОборотов".
				НовыйРодитель = ГруппаСтруктуры;
			Иначе
				НовыйРодитель = Справочники.бит_СтатьиБюджета.ПолучитьСсылку();
			КонецЕсли; 
			Родители.Вставить(Выборка.Родитель, НовыйРодитель);
		КонецЕсли; 			
		ТекущийОбъект.Родитель = НовыйРодитель;
		
		Если Выборка.ЭтоГруппа Тогда
			ТекущийЭлемент = Родители.Получить(Выборка.Ссылка);
			Если ТекущийЭлемент = Неопределено Тогда
				ТекущийЭлемент = Справочники.бит_СтатьиБюджета.ПолучитьСсылку();
				Родители.Вставить(Выборка.Ссылка, ТекущийЭлемент);
			КонецЕсли; 
			ТекущийОбъект.УстановитьСсылкуНового(ТекущийЭлемент);
		КонецЕсли; 
		
		ТекущийОбъект.УстановитьНовыйКод();
		Если ТекущийОбъект.ПроверитьЗаполнение() Тогда
			ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоКопирование", Истина);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекущийОбъект, Истина, Истина);
			ДобавленныеОбъекты.Добавить(ТекущийОбъект.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Справочники.бит_Бюджеты.ОбработатьБюджетЗапрещенКПланированию(Бюджет);
	ПоместитьВоВременноеХранилище(Новый Структура("ДобавленныеОбъекты, Ошибки", ДобавленныеОбъекты, Ошибки), АдресВХранилище);
	
КонецПроцедуры

// Проверяется уникальность ссылки на статью оборотов в рамках владельца.
//  Если этого не обеспечить, тогда заполнение формы ввода бюджета по бюджету
//  приводит к ошибкам из-за особенности реализации связи ячейки и строки данных бюджета.
//
// Параметры:
//  Статья	 - СправочникСсылка.бит_СтатьиБюджета	 - Проверяемая статья.
//  Отказ	 - Булево								 - отменяет стандартную обработку вызывающего обработчика.
//
Процедура СтатьяБюджетаУникальна(Статья, Отказ) Экспорт
	
	РеквизитыСтатьиБюджета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Статья, "Владелец,СтатьяОборотов");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",			Статья);
	Запрос.УстановитьПараметр("Бюджет",			РеквизитыСтатьиБюджета.Владелец);
	Запрос.УстановитьПараметр("СтатьяОборотов",	РеквизитыСтатьиБюджета.СтатьяОборотов);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтатьиБюджета.Ссылка КАК Ссылка,
	|	СтатьиБюджета.Представление КАК Представление,
	|	ВЫБОР
	|		КОГДА ОбъектыПоБюджету.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьСсылкиНаБюджет
	|ИЗ
	|	Справочник.бит_СтатьиБюджета КАК СтатьиБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КритерийОтбора.бит_ОбъектыПоБюджету(&Бюджет) КАК ОбъектыПоБюджету
	|		ПО (СтатьиБюджета.Владелец = &Бюджет)
	|ГДЕ
	|	СтатьиБюджета.Ссылка <> &Ссылка
	|	И СтатьиБюджета.Владелец = &Бюджет
	|	И НЕ СтатьиБюджета.ПометкаУдаления
	|	И СтатьиБюджета.СтатьяОборотов = &СтатьяОборотов";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ЕстьСсылкиНаБюджет Тогда
			ШаблонСообщения = СтрШаблон(НСтр("ru='Статья оборотов уже используется в статье бюджета ""%1"". Дублирование статей запрещено, бюджет используется в справочнике ""Настройки форм ввода бюджета"".';
											 |en='Article speed is already used in the budget article ""%1"". Duplication prohibited articles, the budget is used in the ""Settings budget entry forms.""'"),
										Выборка.Представление);
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ","КОРРЕКТНОСТЬ",
										НСтр("ru='Статья оборотов';en='Line Item'"),,,ШаблонСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСтатьюНаЦикличность(СтатьяБюджета, Отказ) Экспорт
	
	ЕстьЦикл 		= Ложь;
	РеквизитыСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяБюджета, "Владелец, ЭтоРасчет");
	
	Если НЕ РеквизитыСтатьи.ЭтоРасчет Тогда
		Возврат;
	КонецЕсли;
	
	СписокСмежности = СписокСмежностиПоискаЦикла(РеквизитыСтатьи.Владелец);
	Если НЕ ЗначениеЗаполнено(СписокСмежности) Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыВершин 	= Новый Соответствие();
	Если СтатусыВершин[СтатьяБюджета] = Неопределено Тогда // Не проверенная вершина.
		МаршрутЦикла = Новый Массив();
		ЕстьЦикл = ПоискЦиклаВГлубину(СтатьяБюджета, СписокСмежности, МаршрутЦикла, СтатусыВершин);
	КонецЕсли;
	
	Если ЕстьЦикл Тогда
		СообщитьОЦиклическихСсылках(МаршрутЦикла, Отказ); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыРасчета.Ссылка КАК Ссылка,
		|	ПараметрыРасчета.НомерСтроки КАК НомерСтроки,
		|	ПараметрыРасчета.ИмяПараметра КАК ИмяПараметра,
		|	ПараметрыРасчета.ЗначениеПараметра КАК ЗначениеПараметра
		|ИЗ
		|	Справочник.бит_СтатьиБюджета.ПараметрыРасчета КАК ПараметрыРасчета
		|ГДЕ
		|	ПараметрыРасчета.Ссылка = &Ссылка
		|	И ПараметрыРасчета.ЗначениеПараметра В(&МаршрутЦикла)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("МаршрутЦикла", МаршрутЦикла);
		Запрос.УстановитьПараметр("Ссылка"		, СтатьяБюджета);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка			 = РезультатЗапроса.Выбрать();		
		Пока Выборка.Следующий() Цикл
			Поле = "Объект.ПараметрыРасчета[%1].ЗначениеПараметра";
			Поле = СтрШаблон(Поле, Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
								НСтр("ru = 'Значение параметра';en='Parameter value'"), 
								Выборка.НомерСтроки, НСтр("ru='Параметры расчета';en='Calculation parameters'"));				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СтатьяБюджета, Поле,, Отказ);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыборкаСтатейБюджета(Бюджет, ГруппаСтатей)
	
	// Дублирование статей бюджетов в рамках одного бюджета не поддерживается.
	// Поэтому соединяемся с существующими записями.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Группа", ГруппаСтатей);
	Запрос.УстановитьПараметр("Бюджет", Бюджет);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиОборотов.Ссылка КАК Ссылка,
	|	СтатьиОборотов.Родитель КАК Родитель,
	|	СтатьиОборотов.Наименование КАК Наименование,
	|	СтатьиОборотов.НаименованиеПолное КАК НаименованиеПолное,
	|	СтатьиОборотов.Кодификатор КАК Кодификатор,
	|	СтатьиОборотов.РасходДоход КАК РасходДоход,
	|	СтатьиОборотов.ЭтоГруппа КАК ЭтоГруппа,
	|	СтатьиОборотов.Ссылка КАК СтатьяОборотов,
	|	СтатьиОборотов.Наименование + "" ("" + СтатьиОборотов.Код + "")"" КАК ПредставлениеЭлементаСтруктуры,
	|	СтатьиОборотов.Наименование + "" ("" + СтатьиОборотов.Код + "")"" КАК ПредставлениеСтатьи
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|ГДЕ
	|	СтатьиОборотов.Ссылка В ИЕРАРХИИ(&Группа)
	|	И НЕ СтатьиОборотов.ПометкаУдаления";	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Возврат Выборка;

КонецФункции 

Функция СписокСмежностиПоискаЦикла(Бюджет)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Владелец", Бюджет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_СтатьиБюджетаПараметрыРасчета.Ссылка КАК Ссылка,
	|	бит_СтатьиБюджетаПараметрыРасчета.ЗначениеПараметра КАК ЗначениеПараметра
	|ИЗ
	|	Справочник.бит_СтатьиБюджета.ПараметрыРасчета КАК бит_СтатьиБюджетаПараметрыРасчета
	|ГДЕ
	|	бит_СтатьиБюджетаПараметрыРасчета.Ссылка.Владелец = &Владелец
	|	И бит_СтатьиБюджетаПараметрыРасчета.ЗначениеПараметра.ЭтоРасчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокСмежности = Новый Соответствие;
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		Пока Выборка.Следующий() Цикл
			ПараметрРасчета = Выборка.ЗначениеПараметра;
			Если СписокСмежности[ПараметрРасчета] = Неопределено Тогда
				СмежныеВершины = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка.Ссылка);
				СписокСмежности.Вставить(ПараметрРасчета, СмежныеВершины); 
			Иначе	
				СписокСмежности[ПараметрРасчета].Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокСмежности;
	
КонецФункции

Функция ПоискЦиклаВГлубину(Вершина, СписокСмежности, МаршрутЦикла, СтатусыВершин)
	
	Результат = Ложь;
	МаршрутЦикла.Добавить(Вершина);
	
	СтатусыВершин[Вершина] = Истина; // Вершина на проверке. 
	СмежныеВершины = СписокСмежности[Вершина]; 
	
	Если ЗначениеЗаполнено(СмежныеВершины) Тогда
		Для каждого СмежнаяВершина Из СмежныеВершины Цикл
			Если СписокСмежности.Получить(СмежнаяВершина) = Неопределено Тогда
				// Достигнут конец маршрута.
				Продолжить;
			ИначеЕсли СтатусыВершин[СмежнаяВершина] = Неопределено Тогда
				// Переход на уровень ниже.
				Результат = ПоискЦиклаВГлубину(СмежнаяВершина, СписокСмежности, МаршрутЦикла, СтатусыВершин);
			ИначеЕсли СтатусыВершин[СмежнаяВершина] = Истина Тогда
				// Найден цикл, возврат к вершине в состоянии проверки.
				МаршрутЦикла.Добавить(СмежнаяВершина);
				Результат = Истина;
			КонецЕсли;
			
			Если Результат = Истина Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Если Результат = Ложь Тогда
		// Вершина проверена.
		СтатусыВершин[Вершина] = Ложь;
		МаршрутЦикла.Удалить(МаршрутЦикла.ВГраница());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СообщитьОЦиклическихСсылках(МаршрутЦикла, Отказ)

	ТекстСообщения = НСтр("ru='Найдены циклические ссылки:
							|%1.';
							|en='Cyclic links found:
							|%1.'");
	
	ЯчейкиМаршрута = Новый Массив();
	// Последний элемент повторяется в маршруте образуя цикл.
	ВГраница = МаршрутЦикла.ВГраница();
	НачалоЦикла = МаршрутЦикла.Найти(МаршрутЦикла[ВГраница]);
	Для Инд = НачалоЦикла По ВГраница Цикл
		ТекВершина = МаршрутЦикла[Инд];
		ЯчейкиМаршрута.Добавить(ТекВершина);
	КонецЦикла; 
	
	Разделитель = " > ";
	СтрЯчейки = СтрСоединить(ЯчейкиМаршрута, Разделитель);
	ТекстСообщения = СтрШаблон(ТекстСообщения, СтрЯчейки); 	
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	
КонецПроцедуры 

Функция СоответствующаяСтатья(СтатьяИсточника, СоответствиеСтатей)
	
	ПустаяСтатья = Справочники.бит_СтатьиБюджета.ПустаяСсылка();
	Если СтатьяИсточника = ПустаяСтатья Тогда
		Возврат ПустаяСтатья;
	КонецЕсли;
		
	СтатьяПриемника = СоответствиеСтатей.Получить(СтатьяИсточника);
	Если СтатьяПриемника = Неопределено Тогда
		СтатьяПриемника = Справочники.бит_СтатьиБюджета.ПолучитьСсылку();
		СоответствиеСтатей.Вставить(СтатьяИсточника, СтатьяПриемника);
	КонецЕсли;
	
	Возврат СтатьяПриемника;
	
КонецФункции

#КонецОбласти 

#КонецЕсли
